In [2]:
import pandas as pd
import numpy as np

In [14]:
# Homework 1
data = {
    'First Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
df

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [15]:
# 1. Rename column names
df.rename(columns={'First Name': 'first_name', 'Age': 'age'}, inplace=True)
df

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [17]:
# 2. Print the first 3 rows
print("First 3 rows:\n", df.head(3))

First 3 rows:
   first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

In [18]:
# 3. Find the mean age
mean_age = df['age'].mean()
print("\nMean age:", mean_age)

Mean age: 32.5

In [19]:
# 4. Select and print only the 'first_name' and 'City' columns
print("\nName and City:\n", df[['first_name', 'City']])

Name and City:
   first_name           City
0      Alice       New York
1        Bob  San Francisco
2    Charlie    Los Angeles
3      David        Chicago

In [20]:
# 5. Add a new column 'Salary' with random salary values
df['Salary'] = np.random.randint(50000, 100000, size=len(df))
print("\nDataFrame with Salary:\n", df)

DataFrame with Salary:
   first_name  age           City  Salary
0      Alice   25       New York   55419
1        Bob   30  San Francisco   51189
2    Charlie   35    Los Angeles   53181
3      David   40        Chicago   76162

In [21]:
# 6. Display summary statistics
print("\nSummary Statistics:\n", df.describe())

Summary Statistics:
              age        Salary
count   4.000000      4.000000
mean   32.500000  58987.750000
std     6.454972  11579.143416
min    25.000000  51189.000000
25%    28.750000  52683.000000
50%    32.500000  54300.000000
75%    36.250000  60604.750000
max    40.000000  76162.000000

In [ ]:
# Homework 2
# 1. Create a DataFrame named sales_and_expenses with columns 'Month', 'Sales', and 'Expenses', 
# representing monthly sales and expenses data
sales_data = {
    'Month': ['Jan', 'Feb', 'Mar', 'Apr'],
    'Sales': [5000, 6000, 7500, 8000],
    'Expenses': [3000, 3500, 4000, 4500]
}
sales_and_expenses = pd.DataFrame(sales_data)
sales_and_expenses

  Month  Sales  Expenses
0   Jan   5000      3000
1   Feb   6000      3500
2   Mar   7500      4000
3   Apr   8000      4500

In [23]:
# 2. Max values
print("Max Sales:", sales_and_expenses['Sales'].max())
print("Max Expenses:", sales_and_expenses['Expenses'].max())

# 3. Min values
print("Min Sales:", sales_and_expenses['Sales'].min())
print("Min Expenses:", sales_and_expenses['Expenses'].min())

# 4. Average values
print("Average Sales:", sales_and_expenses['Sales'].mean())
print("Average Expenses:", sales_and_expenses['Expenses'].mean())

Max Sales: 8000
Max Expenses: 4500
Min Sales: 5000
Min Expenses: 3000
Average Sales: 6625.0
Average Expenses: 3750.0

In [24]:
# Homework 3
# 1. Create a DataFrame named expenses with columns 'Category', 'January',
# 'February', 'March', and 'April', representing monthly expenses for different categories
expense_data = {
    'Category': ['Rent', 'Utilities', 'Groceries', 'Entertainment'],
    'January': [1200, 200, 300, 150],
    'February': [1300, 220, 320, 160],
    'March': [1400, 240, 330, 170],
    'April': [1500, 250, 350, 180]
}
expenses = pd.DataFrame(expense_data)
expenses

        Category  January  February  March  April
0           Rent     1200      1300   1400   1500
1      Utilities      200       220    240    250
2      Groceries      300       320    330    350
3  Entertainment      150       160    170    180

In [ ]:
expenses = expenses.set_index('Category')

In [31]:
expenses

               January  February  March  April
Category
Rent              1200      1300   1400   1500
Utilities          200       220    240    250
Groceries          300       320    330    350
Entertainment      150       160    170    180

In [32]:
# 2. Max expense per category
print("Maximum expense per category:\n", expenses.max(axis=1))

# 3. Min expense per category
print("\nMinimum expense per category:\n", expenses.min(axis=1))

# 4. Average expense per category
print("\nAverage expense per category:\n", expenses.mean(axis=1))

Maximum expense per category:
 Category
Rent             1500
Utilities         250
Groceries         350
Entertainment     180
dtype: int64

Minimum expense per category:
 Category
Rent             1200
Utilities         200
Groceries         300
Entertainment     150
dtype: int64

Average expense per category:
 Category
Rent             1350.0
Utilities         227.5
Groceries         325.0
Entertainment     165.0
dtype: float64